In [1]:
# Bismillah

In [2]:
people = {
    'first': ['Corey', 'Jane', 'John'],
    'last':  ['Schafer', 'Doe', 'Doe'],
    'email': ['CoreySchafer@gmail.com', 'JaneDoe@gmail.com', 'JohnDoe@gmail.com']
}

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people) # passing a dictionary does not need to be passed as a string.

In [5]:
df

   first     last                   email
0  Corey  Schafer  CoreySchafer@gmail.com
1   Jane      Doe       JaneDoe@gmail.com
2   John      Doe       JohnDoe@gmail.com

In [6]:
df.columns # produces a list of headers (keys) of a dataframe/table.

Index(['first', 'last', 'email'], dtype='object')

In [7]:
type(df.columns)

pandas.core.indexes.base.Index

In [8]:
df.columns = ['first_name', 'last_name', 'email'] # first method: to change ALL the headers of a dataframe.

In [9]:
df.columns

Index(['first_name', 'last_name', 'email'], dtype='object')

In [10]:
df

  first_name last_name                   email
0      Corey   Schafer  CoreySchafer@gmail.com
1       Jane       Doe       JaneDoe@gmail.com
2       John       Doe       JohnDoe@gmail.com

In [11]:
df.columns = [x.upper() for x in df.columns] 
# second method: to convert ALL the headers of a dataframe into uppercase letters.
# df.columns contains a list of column headings as shown above.
# for loop takes each column heading one by one and puts it in x and it is passed on to the function upper(). So, for the
# first time, 'first_name' is put in variable 'x' and then passed on as 'first_name.upper()' which converts it into '
# FIRST_NAME'.
# the same happens for ther headings as well and finally stored in df.columns as shown below.

In [12]:
df.columns

Index(['FIRST_NAME', 'LAST_NAME', 'EMAIL'], dtype='object')

In [13]:
df

  FIRST_NAME LAST_NAME                   EMAIL
0      Corey   Schafer  CoreySchafer@gmail.com
1       Jane       Doe       JaneDoe@gmail.com
2       John       Doe       JohnDoe@gmail.com

In [14]:
df.columns = df.columns.str.replace('_', ' ')
# to replace all the underscores by spaces in ALL the headers of dataframe.

In [15]:
df.columns

Index(['FIRST NAME', 'LAST NAME', 'EMAIL'], dtype='object')

In [16]:
df

  FIRST NAME LAST NAME                   EMAIL
0      Corey   Schafer  CoreySchafer@gmail.com
1       Jane       Doe       JaneDoe@gmail.com
2       John       Doe       JohnDoe@gmail.com

In [17]:
df.columns = df.columns.str.replace(' ', '_')
# to replace all the spaces by underscores in ALL the headers of dataframe.

In [18]:
df

  FIRST_NAME LAST_NAME                   EMAIL
0      Corey   Schafer  CoreySchafer@gmail.com
1       Jane       Doe       JaneDoe@gmail.com
2       John       Doe       JohnDoe@gmail.com

In [19]:
df.columns = [x.lower() for x in df.columns] # to convert ALL the headers of dataframe into lowercase letters.

In [20]:
df

  first_name last_name                   email
0      Corey   Schafer  CoreySchafer@gmail.com
1       Jane       Doe       JaneDoe@gmail.com
2       John       Doe       JohnDoe@gmail.com

In [21]:
df.rename(columns = {'first_name': 'first', 'last_name': 'last'}, inplace = True)
# fourth method: to change SOME headers of a dataframe.

In [22]:
df

   first     last                   email
0  Corey  Schafer  CoreySchafer@gmail.com
1   Jane      Doe       JaneDoe@gmail.com
2   John      Doe       JohnDoe@gmail.com

In [23]:
# the above discussion related to chaning data in columns, specifically column headers. The following discussion relates
# to changing data in a row.

# Revision:

* Revise the concepts of .loc before changing the data in rows

In [24]:
df['first'] # to produce column titled, first. Note the '' around first.

0    Corey
1     Jane
2     John
Name: first, dtype: object

In [25]:
df.loc[0] # to produce row indexed 0 or grab the row indexed 0, which can be worked at as desired. For instance, change
# the last name of John from Doe to Smith and change his email id accordingly.

first                     Corey
last                    Schafer
email    CoreySchafer@gmail.com
Name: 0, dtype: object

In [26]:
df.loc[2] = ['John', 'Smith', 'JohnSmith@gmail.com']
# df.loc[2] will grab the row indexed 2 and then set it equal to the values given in the list on R.H.S of the equation.
# the downside of this method is to pass the values for all the columns, which is a pain.

In [27]:
df

   first     last                   email
0  Corey  Schafer  CoreySchafer@gmail.com
1   Jane      Doe       JaneDoe@gmail.com
2   John    Smith     JohnSmith@gmail.com

In [28]:
df.loc[2, ['last', 'email']] # first the rown indexed is grabed and then in that row, values in columns 'last' and 'email'
# are grabed. Once we grabed our desired values, we can then manipulate them as we desire.
# Note that if we want to use second [] inside the first [], then we don't have to use colons. So, we can pick any columns
# in the dataframe.

last                   Smith
email    JohnSmith@gmail.com
Name: 2, dtype: object

In [29]:
df.loc[2][1:3] # alternative to the above method. This is use of nested sequence/list.
# Note that if we want to use second [] outside of the first [], then we have to use colons. That we means we must columns
# that follow one after another.

last                   Smith
email    JohnSmith@gmail.com
Name: 2, dtype: object

In [30]:
df.loc[2]['last':'email'] # another method of producing the same information.
# Note that if we want to use second [] outside of the first [], then we have to use colons. That we means we must columns
# that follow one after another.

last                   Smith
email    JohnSmith@gmail.com
Name: 2, dtype: object

In [31]:
df.loc[2, ['last', 'email']] = ['Doe', 'JohnDoe@gmail.com']
# Note that if we want to use second [] outside of the first [], then we have to use colons. That we means we must columns
# that follow one after another.

In [32]:
df

   first     last                   email
0  Corey  Schafer  CoreySchafer@gmail.com
1   Jane      Doe       JaneDoe@gmail.com
2   John      Doe       JohnDoe@gmail.com

In [33]:
df.loc[2, 'last'] = 'smith'
# to change the single value in a row, we don't have to use second [] within the first [], and we also don't have to pass
# list on the R.H.S of the equation.

In [34]:
df

   first     last                   email
0  Corey  Schafer  CoreySchafer@gmail.com
1   Jane      Doe       JaneDoe@gmail.com
2   John    smith       JohnDoe@gmail.com

In [35]:
df.at[2, 'last'] = 'Doe'
# to change the single value, we can use .at instead of .loc. They both work exactly the same for single values.

In [36]:
df

   first     last                   email
0  Corey  Schafer  CoreySchafer@gmail.com
1   Jane      Doe       JaneDoe@gmail.com
2   John      Doe       JohnDoe@gmail.com

In [37]:
filt = df['email'] == 'JohnDoe@gmail.com' # create a filter and call it, filt. df['email'] grabs the column, email, and 
# then look for JohnDoe@gmail.com in that column. Where this condition is met, True is stored in the variable or filter,
# filt, and where this condition is not met, False is stored in it.

In [38]:
filt

0    False
1    False
2     True
Name: email, dtype: bool

In [39]:
df[filt] # it produces that part of dataframe where 'filt' contains True. Also, note that we don't use '' around filter.

  first last              email
2  John  Doe  JohnDoe@gmail.com

In [40]:
df[filt]['last']

2    Doe
Name: last, dtype: object

In [41]:
df[filt]['last'] = 'Smith' # produces error. It is better to use .loc as shown below.

C:\Users\MUSADA~1\AppData\Local\Temp/ipykernel_22648/4105620410.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]['last'] = 'Smith' # produces error. It is better to use .loc as shown below.

In [42]:
df.loc[filt]['last'] = 'Smith' # still produces the same error even with .loc

C:\Users\MUSADA~1\AppData\Local\Temp/ipykernel_22648/577842939.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.loc[filt]['last'] = 'Smith' # still produces the same error even with .loc

In [43]:
df.loc[filt, 'last'] = 'Smith' # moral of the story is to use .loc in this pattern when we have a filter and want to 
# change a value in a particular column.

In [44]:
df

   first     last                   email
0  Corey  Schafer  CoreySchafer@gmail.com
1   Jane      Doe       JaneDoe@gmail.com
2   John    Smith       JohnDoe@gmail.com

In [45]:
# change all the email addresses to lower case. First, we need to grab all the email addresses.
df['email'] # first method to grab all the email addresses for manipulation.

0    CoreySchafer@gmail.com
1         JaneDoe@gmail.com
2         JohnDoe@gmail.com
Name: email, dtype: object

In [46]:
df['email'] = ['coreyschafer@gmail.com', 'janedoe@gmail.com', 'johndoe@gmail.com']

In [47]:
df['email']

0    coreyschafer@gmail.com
1         janedoe@gmail.com
2         johndoe@gmail.com
Name: email, dtype: object

In [48]:
df['email'] = ['CoreySchafer@gmail.com', 'JaneDoe@gmail.com', 'JohnDoe@gmail.com'] # changed back to capital letters

In [49]:
df['email']

0    CoreySchafer@gmail.com
1         JaneDoe@gmail.com
2         JohnDoe@gmail.com
Name: email, dtype: object

In [50]:
df.loc[0:2, 'email'] # second way to grab the email address

0    CoreySchafer@gmail.com
1         JaneDoe@gmail.com
2         JohnDoe@gmail.com
Name: email, dtype: object

In [51]:
df.loc[0:2, 'email'] = ['coreyschafer@gmail.com', 'janedoe@gmail.com', 'johndoe@gmail.com']

In [52]:
df.loc[0:2, 'email']

0    coreyschafer@gmail.com
1         janedoe@gmail.com
2         johndoe@gmail.com
Name: email, dtype: object

In [53]:
df.loc[0:2, 'email'] = ['CoreySchafer@gmail.com', 'JaneDoe@gmail.com', 'JohnDoe@gmail.com'] # changed back to capital letters

In [54]:
df.loc[0:2, 'email'] # in both the methods, we have to manually type the list of email addresses, which isn't efficient.

0    CoreySchafer@gmail.com
1         JaneDoe@gmail.com
2         JohnDoe@gmail.com
Name: email, dtype: object

In [55]:
df['email'] = [x.lower() for x in df['email']] # can use the list comprehension with both the above methods.

In [56]:
df['email']

0    coreyschafer@gmail.com
1         janedoe@gmail.com
2         johndoe@gmail.com
Name: email, dtype: object

In [57]:
df['email'] = [x.upper() for x in df['email']] # all email addresses changed to upper case.

In [58]:
df['email']

0    COREYSCHAFER@GMAIL.COM
1         JANEDOE@GMAIL.COM
2         JOHNDOE@GMAIL.COM
Name: email, dtype: object

In [59]:
# df['email'].lower() # produces error

In [60]:
df['email'].str.lower() # this works now. df['email'] grabs all the email addresses, then method/class string is called
# and then in the string class, method lower() is called.

0    coreyschafer@gmail.com
1         janedoe@gmail.com
2         johndoe@gmail.com
Name: email, dtype: object

In [61]:
df # note that the change has not been implemented.

   first     last                   email
0  Corey  Schafer  COREYSCHAFER@GMAIL.COM
1   Jane      Doe       JANEDOE@GMAIL.COM
2   John    Smith       JOHNDOE@GMAIL.COM

In [62]:
# df['email'].str.lower(), inplace = True # inplace does not work with it.

In [63]:
df['email'] = df['email'].str.lower() # instead of using inplace command, we can directly set the values in df['email']
# equal to our desired values.

In [64]:
df

   first     last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       janedoe@gmail.com
2   John    Smith       johndoe@gmail.com

# Four Methods:
These four methods can be used to make more advanced changes.
* apply 
    * apply can be used for both series and single values.
* map
* applymap
* replace

In [65]:
# df['email'].(len) # produces error

In [66]:
df['email'].apply(len) # apply the length function to the series of email addresses.

0    22
1    17
2    17
Name: email, dtype: int64

In [67]:
# we can make our own functions, and apply them to the series in our dataframe.
def update_email(email):
    return email.upper()

In [68]:
df['email'].apply(update_email) # don't type apply(update_email()), type it as we just did above apply(len).
# df['email'] grabs all the email addresses and passes them on to apply(update_email) one by one. So, it is like, 
# 'coreyschafer@gmail.com'.apply(update_email). The method update_email receives 'coreyschafer@gamil.com' as an argument
# and stores it in variable, email, and then in its body 'coreyschafer@gmail.com'.upper() is implemented, which converts
# all the letters in email address into upper case and return the email address in upper case. Then the next email is 
# passed on and the same procedure is repeated.

0    COREYSCHAFER@GMAIL.COM
1         JANEDOE@GMAIL.COM
2         JOHNDOE@GMAIL.COM
Name: email, dtype: object

In [69]:
df # the change has not been actually made.

   first     last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       janedoe@gmail.com
2   John    Smith       johndoe@gmail.com

In [70]:
df['email'] = df['email'].apply(update_email)

In [71]:
df

   first     last                   email
0  Corey  Schafer  COREYSCHAFER@GMAIL.COM
1   Jane      Doe       JANEDOE@GMAIL.COM
2   John    Smith       JOHNDOE@GMAIL.COM

In [72]:
df['email'] = df['email'].apply(lambda x: x.lower())
# x.lower() will return the lower case email addresses.
# instead of applying 'update_email' function, we have applied here the lambda function.

In [73]:
df

   first     last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       janedoe@gmail.com
2   John    Smith       johndoe@gmail.com

In [74]:
# All above, we used 'apply' on series. Now, let use use it on dataframe.

df.apply(len) # produces the number of elements in each row of all the columns.

first    3
last     3
email    3
dtype: int64

In [75]:
len(df['email'])

3

In [76]:
df.apply(len, axis = 'columns') # produces the number of elements in each column of all the rows. Also, it works the same
# without 'axist ='

0    3
1    3
2    3
dtype: int64

In [77]:
df

   first     last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       janedoe@gmail.com
2   John    Smith       johndoe@gmail.com

In [79]:
df.apply(pd.Series.min) # to grab minimum value in each columns. It will make more sense with numerical data.
# min is the method.

first                     Corey
last                        Doe
email    coreyschafer@gmail.com
dtype: object

In [80]:
df.apply(lambda x: x.min()) # x is the series here using lambda method.

first                     Corey
last                        Doe
email    coreyschafer@gmail.com
dtype: object

In [81]:
# Running apply on a datafram performs the required method on all the serieses in the data frame. Running apply on a 
# series apply the required method on all the values in the dataframe. Following is the method to perform the desired
# method on each value or all the elements in the dataframe.

In [84]:
df.applymap(len) # applied length function to all the elements in the dataframe. Map only works exists for dataframe and
# not for a series.

   first  last  email
0      5     7     22
1      4     3     17
2      4     5     17

In [91]:
df.applymap(str.lower) # remember str.lower. Why it is without (), though?

   first     last                   email
0  corey  schafer  coreyschafer@gmail.com
1   jane      doe       janedoe@gmail.com
2   john    smith       johndoe@gmail.com

In [94]:
# MAP METHOD: Substitue some values
df['first'].map({'Corey': 'Chris', 'Jane': 'Mary'})
# Note that John has been substituted by NaN. If we don't want that to happen, then we should use REPLACE method instead
# MAP method.

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

In [95]:
df['first'].replace({'Corey': 'Christ', 'Jane': 'Mary'}) # now John is there and not replaced.

0    Christ
1      Mary
2      John
Name: first, dtype: object

In [96]:
df

   first     last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       janedoe@gmail.com
2   John    Smith       johndoe@gmail.com

In [97]:
df['first'].replace({'Corey': 'Christ', 'Jane': 'Mary'}, inplace = True)

In [98]:
df

    first     last                   email
0  Christ  Schafer  coreyschafer@gmail.com
1    Mary      Doe       janedoe@gmail.com
2    John    Smith       johndoe@gmail.com